name: "multiori-subvolume-sup"
input: "data"
input_shape {
  dim: 1
  dim: 20
  dim: 30
  dim: 30
  dim: 30
}
layer {
  name: "slice_data"
  type: "Slice"
  bottom: "data"
  top: "data_1"
  top: "data_2"
  top: "data_3"
  top: "data_4"
  top: "data_5"
  top: "data_6"
  top: "data_7"
  top: "data_8"
  top: "data_9"
  top: "data_10"
  top: "data_11"
  top: "data_12"
  top: "data_13"
  top: "data_14"
  top: "data_15"
  top: "data_16"
  top: "data_17"
  top: "data_18"
  top: "data_19"
  top: "data_20"
  slice_param {
    slice_dim: 1
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
  }
}
# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data_1"
  top: "conv1"
  param {
    name: "conv1_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 6
    kernel_size: 6
    kernel_size: 6
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp11"
  type: "Convolution"
  bottom: "conv1"
  top: "cccp11"
  param {
    name: "cccp11_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp11_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp11_relu"
  type: "ReLU"
  bottom: "cccp11"
  top: "cccp11"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp12"
  type: "Convolution"
  bottom: "cccp11"
  top: "cccp12"
  param {
    name: "cccp12_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp12_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp12_relu"
  type: "ReLU"
  bottom: "cccp12"
  top: "cccp12"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "cccp12"
  top: "conv2"
  param {
    name: "conv2_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 5
    kernel_size: 5
    kernel_size: 5
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp21"
  type: "Convolution"
  bottom: "conv2"
  top: "cccp21"
  param {
    name: "cccp21_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp21_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp21_relu"
  type: "ReLU"
  bottom: "cccp21"
  top: "cccp21"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp22"
  type: "Convolution"
  bottom: "cccp21"
  top: "cccp22"
  param {
    name: "cccp22_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp22_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp22_relu"
  type: "ReLU"
  bottom: "cccp22"
  top: "cccp22"
}


# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "cccp22"
  top: "conv3"
  param {
    name: "conv3_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 4
    kernel_size: 4
    kernel_size: 4
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}

# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "cccp31"
  type: "Convolution"
  bottom: "conv3"
  top: "cccp31"
  param {
    name: "cccp31_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp31_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.06
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "data_2"
  top: "conv1_2"
  param {
    name: "conv1_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 6
    kernel_size: 6
    kernel_size: 6
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "conv1_2"
  top: "conv1_2"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp11_2"
  type: "Convolution"
  bottom: "conv1_2"
  top: "cccp11_2"
  param {
    name: "cccp11_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp11_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp11_relu_2"
  type: "ReLU"
  bottom: "cccp11_2"
  top: "cccp11_2"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp12_2"
  type: "Convolution"
  bottom: "cccp11_2"
  top: "cccp12_2"
  param {
    name: "cccp12_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp12_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp12_relu_2"
  type: "ReLU"
  bottom: "cccp12_2"
  top: "cccp12_2"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "cccp12_2"
  top: "conv2_2"
  param {
    name: "conv2_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 5
    kernel_size: 5
    kernel_size: 5
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "conv2_2"
  top: "conv2_2"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp21_2"
  type: "Convolution"
  bottom: "conv2_2"
  top: "cccp21_2"
  param {
    name: "cccp21_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp21_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp21_relu_2"
  type: "ReLU"
  bottom: "cccp21_2"
  top: "cccp21_2"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp22_2"
  type: "Convolution"
  bottom: "cccp21_2"
  top: "cccp22_2"
  param {
    name: "cccp22_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp22_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp22_relu_2"
  type: "ReLU"
  bottom: "cccp22_2"
  top: "cccp22_2"
}


# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "cccp22_2"
  top: "conv3_2"
  param {
    name: "conv3_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 4
    kernel_size: 4
    kernel_size: 4
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}

# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "cccp31_2"
  type: "Convolution"
  bottom: "conv3_2"
  top: "cccp31_2"
  param {
    name: "cccp31_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp31_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.06
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "conv1_3"
  type: "Convolution"
  bottom: "data_3"
  top: "conv1_3"
  param {
    name: "conv1_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 6
    kernel_size: 6
    kernel_size: 6
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu1_3"
  type: "ReLU"
  bottom: "conv1_3"
  top: "conv1_3"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp11_3"
  type: "Convolution"
  bottom: "conv1_3"
  top: "cccp11_3"
  param {
    name: "cccp11_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp11_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp11_relu_3"
  type: "ReLU"
  bottom: "cccp11_3"
  top: "cccp11_3"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp12_3"
  type: "Convolution"
  bottom: "cccp11_3"
  top: "cccp12_3"
  param {
    name: "cccp12_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp12_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp12_relu_3"
  type: "ReLU"
  bottom: "cccp12_3"
  top: "cccp12_3"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "conv2_3"
  type: "Convolution"
  bottom: "cccp12_3"
  top: "conv2_3"
  param {
    name: "conv2_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 5
    kernel_size: 5
    kernel_size: 5
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu2_3"
  type: "ReLU"
  bottom: "conv2_3"
  top: "conv2_3"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp21_3"
  type: "Convolution"
  bottom: "conv2_3"
  top: "cccp21_3"
  param {
    name: "cccp21_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp21_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp21_relu_3"
  type: "ReLU"
  bottom: "cccp21_3"
  top: "cccp21_3"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp22_3"
  type: "Convolution"
  bottom: "cccp21_3"
  top: "cccp22_3"
  param {
    name: "cccp22_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp22_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp22_relu_3"
  type: "ReLU"
  bottom: "cccp22_3"
  top: "cccp22_3"
}


# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "cccp22_3"
  top: "conv3_3"
  param {
    name: "conv3_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 4
    kernel_size: 4
    kernel_size: 4
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "conv3_3"
  top: "conv3_3"
}

# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "cccp31_3"
  type: "Convolution"
  bottom: "conv3_3"
  top: "cccp31_3"
  param {
    name: "cccp31_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp31_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.06
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "conv1_4"
  type: "Convolution"
  bottom: "data_4"
  top: "conv1_4"
  param {
    name: "conv1_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 6
    kernel_size: 6
    kernel_size: 6
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu1_4"
  type: "ReLU"
  bottom: "conv1_4"
  top: "conv1_4"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp11_4"
  type: "Convolution"
  bottom: "conv1_4"
  top: "cccp11_4"
  param {
    name: "cccp11_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp11_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp11_relu_4"
  type: "ReLU"
  bottom: "cccp11_4"
  top: "cccp11_4"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp12_4"
  type: "Convolution"
  bottom: "cccp11_4"
  top: "cccp12_4"
  param {
    name: "cccp12_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp12_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp12_relu_4"
  type: "ReLU"
  bottom: "cccp12_4"
  top: "cccp12_4"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "conv2_4"
  type: "Convolution"
  bottom: "cccp12_4"
  top: "conv2_4"
  param {
    name: "conv2_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 5
    kernel_size: 5
    kernel_size: 5
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu2_4"
  type: "ReLU"
  bottom: "conv2_4"
  top: "conv2_4"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp21_4"
  type: "Convolution"
  bottom: "conv2_4"
  top: "cccp21_4"
  param {
    name: "cccp21_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp21_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp21_relu_4"
  type: "ReLU"
  bottom: "cccp21_4"
  top: "cccp21_4"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp22_4"
  type: "Convolution"
  bottom: "cccp21_4"
  top: "cccp22_4"
  param {
    name: "cccp22_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp22_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp22_relu_4"
  type: "ReLU"
  bottom: "cccp22_4"
  top: "cccp22_4"
}


# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "conv3_4"
  type: "Convolution"
  bottom: "cccp22_4"
  top: "conv3_4"
  param {
    name: "conv3_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 4
    kernel_size: 4
    kernel_size: 4
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu3_4"
  type: "ReLU"
  bottom: "conv3_4"
  top: "conv3_4"
}

# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "cccp31_4"
  type: "Convolution"
  bottom: "conv3_4"
  top: "cccp31_4"
  param {
    name: "cccp31_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp31_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.06
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "conv1_5"
  type: "Convolution"
  bottom: "data_5"
  top: "conv1_5"
  param {
    name: "conv1_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 6
    kernel_size: 6
    kernel_size: 6
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu1_5"
  type: "ReLU"
  bottom: "conv1_5"
  top: "conv1_5"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp11_5"
  type: "Convolution"
  bottom: "conv1_5"
  top: "cccp11_5"
  param {
    name: "cccp11_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp11_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp11_relu_5"
  type: "ReLU"
  bottom: "cccp11_5"
  top: "cccp11_5"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp12_5"
  type: "Convolution"
  bottom: "cccp11_5"
  top: "cccp12_5"
  param {
    name: "cccp12_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp12_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp12_relu_5"
  type: "ReLU"
  bottom: "cccp12_5"
  top: "cccp12_5"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "conv2_5"
  type: "Convolution"
  bottom: "cccp12_5"
  top: "conv2_5"
  param {
    name: "conv2_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 5
    kernel_size: 5
    kernel_size: 5
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu2_5"
  type: "ReLU"
  bottom: "conv2_5"
  top: "conv2_5"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp21_5"
  type: "Convolution"
  bottom: "conv2_5"
  top: "cccp21_5"
  param {
    name: "cccp21_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp21_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp21_relu_5"
  type: "ReLU"
  bottom: "cccp21_5"
  top: "cccp21_5"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp22_5"
  type: "Convolution"
  bottom: "cccp21_5"
  top: "cccp22_5"
  param {
    name: "cccp22_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp22_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp22_relu_5"
  type: "ReLU"
  bottom: "cccp22_5"
  top: "cccp22_5"
}


# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "conv3_5"
  type: "Convolution"
  bottom: "cccp22_5"
  top: "conv3_5"
  param {
    name: "conv3_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 4
    kernel_size: 4
    kernel_size: 4
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu3_5"
  type: "ReLU"
  bottom: "conv3_5"
  top: "conv3_5"
}

# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "cccp31_5"
  type: "Convolution"
  bottom: "conv3_5"
  top: "cccp31_5"
  param {
    name: "cccp31_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp31_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.06
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "conv1_6"
  type: "Convolution"
  bottom: "data_6"
  top: "conv1_6"
  param {
    name: "conv1_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 6
    kernel_size: 6
    kernel_size: 6
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu1_6"
  type: "ReLU"
  bottom: "conv1_6"
  top: "conv1_6"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp11_6"
  type: "Convolution"
  bottom: "conv1_6"
  top: "cccp11_6"
  param {
    name: "cccp11_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp11_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp11_relu_6"
  type: "ReLU"
  bottom: "cccp11_6"
  top: "cccp11_6"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp12_6"
  type: "Convolution"
  bottom: "cccp11_6"
  top: "cccp12_6"
  param {
    name: "cccp12_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp12_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp12_relu_6"
  type: "ReLU"
  bottom: "cccp12_6"
  top: "cccp12_6"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "conv2_6"
  type: "Convolution"
  bottom: "cccp12_6"
  top: "conv2_6"
  param {
    name: "conv2_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 5
    kernel_size: 5
    kernel_size: 5
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu2_6"
  type: "ReLU"
  bottom: "conv2_6"
  top: "conv2_6"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp21_6"
  type: "Convolution"
  bottom: "conv2_6"
  top: "cccp21_6"
  param {
    name: "cccp21_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp21_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp21_relu_6"
  type: "ReLU"
  bottom: "cccp21_6"
  top: "cccp21_6"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp22_6"
  type: "Convolution"
  bottom: "cccp21_6"
  top: "cccp22_6"
  param {
    name: "cccp22_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp22_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp22_relu_6"
  type: "ReLU"
  bottom: "cccp22_6"
  top: "cccp22_6"
}


# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "conv3_6"
  type: "Convolution"
  bottom: "cccp22_6"
  top: "conv3_6"
  param {
    name: "conv3_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 4
    kernel_size: 4
    kernel_size: 4
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu3_6"
  type: "ReLU"
  bottom: "conv3_6"
  top: "conv3_6"
}

# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "cccp31_6"
  type: "Convolution"
  bottom: "conv3_6"
  top: "cccp31_6"
  param {
    name: "cccp31_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp31_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.06
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "conv1_7"
  type: "Convolution"
  bottom: "data_7"
  top: "conv1_7"
  param {
    name: "conv1_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 6
    kernel_size: 6
    kernel_size: 6
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu1_7"
  type: "ReLU"
  bottom: "conv1_7"
  top: "conv1_7"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp11_7"
  type: "Convolution"
  bottom: "conv1_7"
  top: "cccp11_7"
  param {
    name: "cccp11_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp11_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp11_relu_7"
  type: "ReLU"
  bottom: "cccp11_7"
  top: "cccp11_7"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp12_7"
  type: "Convolution"
  bottom: "cccp11_7"
  top: "cccp12_7"
  param {
    name: "cccp12_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp12_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp12_relu_7"
  type: "ReLU"
  bottom: "cccp12_7"
  top: "cccp12_7"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "conv2_7"
  type: "Convolution"
  bottom: "cccp12_7"
  top: "conv2_7"
  param {
    name: "conv2_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 5
    kernel_size: 5
    kernel_size: 5
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu2_7"
  type: "ReLU"
  bottom: "conv2_7"
  top: "conv2_7"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp21_7"
  type: "Convolution"
  bottom: "conv2_7"
  top: "cccp21_7"
  param {
    name: "cccp21_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp21_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp21_relu_7"
  type: "ReLU"
  bottom: "cccp21_7"
  top: "cccp21_7"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp22_7"
  type: "Convolution"
  bottom: "cccp21_7"
  top: "cccp22_7"
  param {
    name: "cccp22_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp22_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp22_relu_7"
  type: "ReLU"
  bottom: "cccp22_7"
  top: "cccp22_7"
}


# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "conv3_7"
  type: "Convolution"
  bottom: "cccp22_7"
  top: "conv3_7"
  param {
    name: "conv3_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 4
    kernel_size: 4
    kernel_size: 4
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu3_7"
  type: "ReLU"
  bottom: "conv3_7"
  top: "conv3_7"
}

# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "cccp31_7"
  type: "Convolution"
  bottom: "conv3_7"
  top: "cccp31_7"
  param {
    name: "cccp31_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp31_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.06
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "conv1_8"
  type: "Convolution"
  bottom: "data_8"
  top: "conv1_8"
  param {
    name: "conv1_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 6
    kernel_size: 6
    kernel_size: 6
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu1_8"
  type: "ReLU"
  bottom: "conv1_8"
  top: "conv1_8"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp11_8"
  type: "Convolution"
  bottom: "conv1_8"
  top: "cccp11_8"
  param {
    name: "cccp11_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp11_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp11_relu_8"
  type: "ReLU"
  bottom: "cccp11_8"
  top: "cccp11_8"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp12_8"
  type: "Convolution"
  bottom: "cccp11_8"
  top: "cccp12_8"
  param {
    name: "cccp12_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp12_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp12_relu_8"
  type: "ReLU"
  bottom: "cccp12_8"
  top: "cccp12_8"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "conv2_8"
  type: "Convolution"
  bottom: "cccp12_8"
  top: "conv2_8"
  param {
    name: "conv2_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 5
    kernel_size: 5
    kernel_size: 5
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu2_8"
  type: "ReLU"
  bottom: "conv2_8"
  top: "conv2_8"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp21_8"
  type: "Convolution"
  bottom: "conv2_8"
  top: "cccp21_8"
  param {
    name: "cccp21_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp21_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp21_relu_8"
  type: "ReLU"
  bottom: "cccp21_8"
  top: "cccp21_8"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp22_8"
  type: "Convolution"
  bottom: "cccp21_8"
  top: "cccp22_8"
  param {
    name: "cccp22_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp22_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp22_relu_8"
  type: "ReLU"
  bottom: "cccp22_8"
  top: "cccp22_8"
}


# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "conv3_8"
  type: "Convolution"
  bottom: "cccp22_8"
  top: "conv3_8"
  param {
    name: "conv3_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 4
    kernel_size: 4
    kernel_size: 4
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu3_8"
  type: "ReLU"
  bottom: "conv3_8"
  top: "conv3_8"
}

# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "cccp31_8"
  type: "Convolution"
  bottom: "conv3_8"
  top: "cccp31_8"
  param {
    name: "cccp31_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp31_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.06
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "conv1_9"
  type: "Convolution"
  bottom: "data_9"
  top: "conv1_9"
  param {
    name: "conv1_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 6
    kernel_size: 6
    kernel_size: 6
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu1_9"
  type: "ReLU"
  bottom: "conv1_9"
  top: "conv1_9"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp11_9"
  type: "Convolution"
  bottom: "conv1_9"
  top: "cccp11_9"
  param {
    name: "cccp11_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp11_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp11_relu_9"
  type: "ReLU"
  bottom: "cccp11_9"
  top: "cccp11_9"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp12_9"
  type: "Convolution"
  bottom: "cccp11_9"
  top: "cccp12_9"
  param {
    name: "cccp12_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp12_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp12_relu_9"
  type: "ReLU"
  bottom: "cccp12_9"
  top: "cccp12_9"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "conv2_9"
  type: "Convolution"
  bottom: "cccp12_9"
  top: "conv2_9"
  param {
    name: "conv2_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 5
    kernel_size: 5
    kernel_size: 5
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu2_9"
  type: "ReLU"
  bottom: "conv2_9"
  top: "conv2_9"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp21_9"
  type: "Convolution"
  bottom: "conv2_9"
  top: "cccp21_9"
  param {
    name: "cccp21_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp21_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp21_relu_9"
  type: "ReLU"
  bottom: "cccp21_9"
  top: "cccp21_9"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp22_9"
  type: "Convolution"
  bottom: "cccp21_9"
  top: "cccp22_9"
  param {
    name: "cccp22_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp22_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp22_relu_9"
  type: "ReLU"
  bottom: "cccp22_9"
  top: "cccp22_9"
}


# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "conv3_9"
  type: "Convolution"
  bottom: "cccp22_9"
  top: "conv3_9"
  param {
    name: "conv3_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 4
    kernel_size: 4
    kernel_size: 4
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu3_9"
  type: "ReLU"
  bottom: "conv3_9"
  top: "conv3_9"
}

# -> conv-out: 64 x 512 x 2 x 2 x 2
layer {
  name: "cccp31_9"
  type: "Convolution"
  bottom: "conv3_9"
  top: "cccp31_9"
  param {
    name: "cccp31_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp31_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.06
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "conv1_10"
  type: "Convolution"
  bottom: "data_10"
  top: "conv1_10"
  param {
    name: "conv1_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 6
    kernel_size: 6
    kernel_size: 6
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu1_10"
  type: "ReLU"
  bottom: "conv1_10"
  top: "conv1_10"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp11_10"
  type: "Convolution"
  bottom: "conv1_10"
  top: "cccp11_10"
  param {
    name: "cccp11_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp11_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp11_relu_10"
  type: "ReLU"
  bottom: "cccp11_10"
  top: "cccp11_10"
}

# -> conv-out: 64 x 48 x 13 x 13 x 13
layer {
  name: "cccp12_10"
  type: "Convolution"
  bottom: "cccp11_10"
  top: "cccp12_10"
  param {
    name: "cccp12_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp12_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.2
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp12_relu_10"
  type: "ReLU"
  bottom: "cccp12_10"
  top: "cccp12_10"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "conv2_10"
  type: "Convolution"
  bottom: "cccp12_10"
  top: "conv2_10"
  param {
    name: "conv2_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 5
    kernel_size: 5
    kernel_size: 5
    stride: 2
    stride: 2
    stride: 2
    weight_filler {
        type: "gaussian"
        std: 0.01
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu2_10"
  type: "ReLU"
  bottom: "conv2_10"
  top: "conv2_10"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp21_10"
  type: "Convolution"
  bottom: "conv2_10"
  top: "cccp21_10"
  param {
    name: "cccp21_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp21_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp21_relu_10"
  type: "ReLU"
  bottom: "cccp21_10"
  top: "cccp21_10"
}

# -> conv-out: 64 x 160 x 5 x 5 x 5
layer {
  name: "cccp22_10"
  type: "Convolution"
  bottom: "cccp21_10"
  top: "cccp22_10"
  param {
    name: "cccp22_w"
    lr_mult: .1
    decay_mult: 1
  }
  param {
    name: "cccp22_b"
    lr_mult: .2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    axis: 1
    kernel_size: 1
    kernel_size: 1
    kernel_size: 1
    stride: 1
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.1
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "cccp22_relu_10"
  type: "ReLU"
  bottom: "cccp22_10"
  top: "cccp22_10"
}


