name: "multiori-ani-probing"
input: "data"
input_shape {
  dim: 1
  dim: 20
  dim: 30
  dim: 30
  dim: 30
}
layer {
  name: "slice_data"
  type: "Slice"
  bottom: "data"
  top: "data_1"
  top: "data_2"
  top: "data_3"
  top: "data_4"
  top: "data_5"
  top: "data_6"
  top: "data_7"
  top: "data_8"
  top: "data_9"
  top: "data_10"
  top: "data_11"
  top: "data_12"
  top: "data_13"
  top: "data_14"
  top: "data_15"
  top: "data_16"
  top: "data_17"
  top: "data_18"
  top: "data_19"
  top: "data_20"
  slice_param {
    slice_dim: 1
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
  }
}

# -> conv-out: 128 x 5 x 1 x 30 x 30
layer {
  name: "aniprobing-1"
  type: "Convolution"
  bottom: "data_1"
  top: "aniprobing-1"
  param {
    name: "aniprobing-1_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 5
    axis: 1
    kernel_size: 30
    kernel_size: 1
    kernel_size: 1
    stride: 30
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.25
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

layer {
  name: "relu-1"
  type: "ReLU"
  bottom: "aniprobing-1"
  top: "aniprobing-1"
}

# -> conv-out: 128 x 1 x 5 x 30 x 30
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-1"
  top: "aniprobing-1-rs"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 5
      dim: 30
      dim: 30
    }
  }
}

# -> conv-out: 128 x 5 x 1 x 30 x 30
layer {
  name: "aniprobing-2"
  type: "Convolution"
  bottom: "aniprobing-1-rs"
  top: "aniprobing-2"
  param {
    name: "aniprobing-2_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-2_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 5
    axis: 1
    kernel_size: 5
    kernel_size: 1
    kernel_size: 1
    stride: 5
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.45
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu-2"
  type: "ReLU"
  bottom: "aniprobing-2"
  top: "aniprobing-2"
}
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-2"
  top: "aniprobing-2-rs"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 5
      dim: 30
      dim: 30
    }
  }
}

# -> conv-out: 128 x 1 x 1 x 30 x 30
layer {
  name: "aniprobing-3"
  type: "Convolution"
  bottom: "aniprobing-2-rs"
  top: "aniprobing-3"
  param {
    name: "aniprobing-3_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 1
    axis: 1
    kernel_size: 5
    kernel_size: 1
    kernel_size: 1
    stride: 5
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.63
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

layer {
  name: "relu-3"
  type: "ReLU"
  bottom: "aniprobing-3"
  top: "aniprobing-3"
}

layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-3"
  top: "aniprobing-3-rs"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 30
      dim: 30
    }
  }
}
####################
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "aniprobing-3-rs"
  top: "conv1"
  param {
    name: "conv1_w"
    lr_mult: 0
  }
  param {
    name: "conv1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.28
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "cccp11"
  type: "Convolution"
;  bottom: "conv1"
  top: "cccp11"
  param {
    name: "cccp11_w"
    lr_mult: 0
  }
  param {
    name: "cccp11_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp11"
  type: "ReLU"
  bottom: "cccp11"
  top: "cccp11"
}
layer {
  name: "cccp12"
  type: "Convolution"
  bottom: "cccp11"
  top: "cccp12"
  param {
    name: "cccp12_w"
    lr_mult: 0
  }
  param {
    name: "cccp12_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.11
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp12"
  type: "ReLU"
  bottom: "cccp12"
  top: "cccp12"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "cccp12"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop1"
  type: "Dropout"
  bottom: "pool1"
  top: "pool1"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    name: "conv2_w"
    lr_mult: 0
  }
  param {
    name: "conv2_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.03
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "cccp21"
  type: "Convolution"
  bottom: "conv2"
  top: "cccp21"
  param {
    name: "cccp21_w"
    lr_mult: 0
  }
  param {
    name: "cccp21_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp21"
  type: "ReLU"
  bottom: "cccp21"
  top: "cccp21"
}
layer {
  name: "cccp22"
  type: "Convolution"
  bottom: "cccp21"
  top: "cccp22"
  param {
    name: "cccp22_w"
    lr_mult: 0
  }
  param {
    name: "cccp22_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp22"
  type: "ReLU"
  bottom: "cccp22"
  top: "cccp22"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "cccp22"
  top: "pool2"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop2"
  type: "Dropout"
  bottom: "pool2"
  top: "pool2"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    name: "conv3_w"
    lr_mult: 0
  }
  param {
    name: "conv3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.03
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "cccp31"
  type: "Convolution"
  bottom: "conv3"
  top: "cccp31"
  param {
    name: "cccp31_w"
    lr_mult: 0
  }
  param {
    name: "cccp31_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
# -> conv-out: 128 x 5 x 1 x 30 x 30
layer {
  name: "aniprobing-1_2"
  type: "Convolution"
  bottom: "data_2"
  top: "aniprobing-1_2"
  param {
    name: "aniprobing-1_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 5
    axis: 1
    kernel_size: 30
    kernel_size: 1
    kernel_size: 1
    stride: 30
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.25
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

layer {
  name: "relu-1_2"
  type: "ReLU"
  bottom: "aniprobing-1_2"
  top: "aniprobing-1_2"
}

# -> conv-out: 128 x 1 x 5 x 30 x 30
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-1_2"
  top: "aniprobing-1-rs_2"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 5
      dim: 30
      dim: 30
    }
  }
}

# -> conv-out: 128 x 5 x 1 x 30 x 30
layer {
  name: "aniprobing-2_2"
  type: "Convolution"
  bottom: "aniprobing-1-rs_2"
  top: "aniprobing-2_2"
  param {
    name: "aniprobing-2_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-2_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 5
    axis: 1
    kernel_size: 5
    kernel_size: 1
    kernel_size: 1
    stride: 5
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.45
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu-2_2"
  type: "ReLU"
  bottom: "aniprobing-2_2"
  top: "aniprobing-2_2"
}
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-2_2"
  top: "aniprobing-2-rs_2"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 5
      dim: 30
      dim: 30
    }
  }
}

# -> conv-out: 128 x 1 x 1 x 30 x 30
layer {
  name: "aniprobing-3_2"
  type: "Convolution"
  bottom: "aniprobing-2-rs_2"
  top: "aniprobing-3_2"
  param {
    name: "aniprobing-3_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 1
    axis: 1
    kernel_size: 5
    kernel_size: 1
    kernel_size: 1
    stride: 5
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.63
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

layer {
  name: "relu-3_2"
  type: "ReLU"
  bottom: "aniprobing-3_2"
  top: "aniprobing-3_2"
}

layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-3_2"
  top: "aniprobing-3-rs_2"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 30
      dim: 30
    }
  }
}
####################
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "aniprobing-3-rs_2"
  top: "conv1_2"
  param {
    name: "conv1_w"
    lr_mult: 0
  }
  param {
    name: "conv1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.28
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "conv1_2"
  top: "conv1_2"
}
layer {
  name: "cccp11_2"
  type: "Convolution"
;  bottom: "conv1_2"
  top: "cccp11_2"
  param {
    name: "cccp11_w"
    lr_mult: 0
  }
  param {
    name: "cccp11_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp11_2"
  type: "ReLU"
  bottom: "cccp11_2"
  top: "cccp11_2"
}
layer {
  name: "cccp12_2"
  type: "Convolution"
  bottom: "cccp11_2"
  top: "cccp12_2"
  param {
    name: "cccp12_w"
    lr_mult: 0
  }
  param {
    name: "cccp12_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.11
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp12_2"
  type: "ReLU"
  bottom: "cccp12_2"
  top: "cccp12_2"
}
layer {
  name: "pool1_2"
  type: "Pooling"
  bottom: "cccp12_2"
  top: "pool1_2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop1_2"
  type: "Dropout"
  bottom: "pool1_2"
  top: "pool1_2"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "pool1_2"
  top: "conv2_2"
  param {
    name: "conv2_w"
    lr_mult: 0
  }
  param {
    name: "conv2_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.03
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "cccp21_2"
  type: "Convolution"
  bottom: "conv2_2"
  top: "cccp21_2"
  param {
    name: "cccp21_w"
    lr_mult: 0
  }
  param {
    name: "cccp21_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp21_2"
  type: "ReLU"
  bottom: "cccp21_2"
  top: "cccp21_2"
}
layer {
  name: "cccp22_2"
  type: "Convolution"
  bottom: "cccp21_2"
  top: "cccp22_2"
  param {
    name: "cccp22_w"
    lr_mult: 0
  }
  param {
    name: "cccp22_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp22_2"
  type: "ReLU"
  bottom: "cccp22_2"
  top: "cccp22_2"
}
layer {
  name: "pool2_2"
  type: "Pooling"
  bottom: "cccp22_2"
  top: "pool2_2"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop2_2"
  type: "Dropout"
  bottom: "pool2_2"
  top: "pool2_2"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "pool2_2"
  top: "conv3_2"
  param {
    name: "conv3_w"
    lr_mult: 0
  }
  param {
    name: "conv3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.03
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "cccp31_2"
  type: "Convolution"
  bottom: "conv3_2"
  top: "cccp31_2"
  param {
    name: "cccp31_w"
    lr_mult: 0
  }
  param {
    name: "cccp31_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
# -> conv-out: 128 x 5 x 1 x 30 x 30
layer {
  name: "aniprobing-1_3"
  type: "Convolution"
  bottom: "data_3"
  top: "aniprobing-1_3"
  param {
    name: "aniprobing-1_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 5
    axis: 1
    kernel_size: 30
    kernel_size: 1
    kernel_size: 1
    stride: 30
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.25
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

layer {
  name: "relu-1_3"
  type: "ReLU"
  bottom: "aniprobing-1_3"
  top: "aniprobing-1_3"
}

# -> conv-out: 128 x 1 x 5 x 30 x 30
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-1_3"
  top: "aniprobing-1-rs_3"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 5
      dim: 30
      dim: 30
    }
  }
}

# -> conv-out: 128 x 5 x 1 x 30 x 30
layer {
  name: "aniprobing-2_3"
  type: "Convolution"
  bottom: "aniprobing-1-rs_3"
  top: "aniprobing-2_3"
  param {
    name: "aniprobing-2_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-2_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 5
    axis: 1
    kernel_size: 5
    kernel_size: 1
    kernel_size: 1
    stride: 5
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.45
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu-2_3"
  type: "ReLU"
  bottom: "aniprobing-2_3"
  top: "aniprobing-2_3"
}
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-2_3"
  top: "aniprobing-2-rs_3"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 5
      dim: 30
      dim: 30
    }
  }
}

# -> conv-out: 128 x 1 x 1 x 30 x 30
layer {
  name: "aniprobing-3_3"
  type: "Convolution"
  bottom: "aniprobing-2-rs_3"
  top: "aniprobing-3_3"
  param {
    name: "aniprobing-3_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 1
    axis: 1
    kernel_size: 5
    kernel_size: 1
    kernel_size: 1
    stride: 5
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.63
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

layer {
  name: "relu-3_3"
  type: "ReLU"
  bottom: "aniprobing-3_3"
  top: "aniprobing-3_3"
}

layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-3_3"
  top: "aniprobing-3-rs_3"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 30
      dim: 30
    }
  }
}
####################
layer {
  name: "conv1_3"
  type: "Convolution"
  bottom: "aniprobing-3-rs_3"
  top: "conv1_3"
  param {
    name: "conv1_w"
    lr_mult: 0
  }
  param {
    name: "conv1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.28
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_3"
  type: "ReLU"
  bottom: "conv1_3"
  top: "conv1_3"
}
layer {
  name: "cccp11_3"
  type: "Convolution"
;  bottom: "conv1_3"
  top: "cccp11_3"
  param {
    name: "cccp11_w"
    lr_mult: 0
  }
  param {
    name: "cccp11_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp11_3"
  type: "ReLU"
  bottom: "cccp11_3"
  top: "cccp11_3"
}
layer {
  name: "cccp12_3"
  type: "Convolution"
  bottom: "cccp11_3"
  top: "cccp12_3"
  param {
    name: "cccp12_w"
    lr_mult: 0
  }
  param {
    name: "cccp12_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.11
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp12_3"
  type: "ReLU"
  bottom: "cccp12_3"
  top: "cccp12_3"
}
layer {
  name: "pool1_3"
  type: "Pooling"
  bottom: "cccp12_3"
  top: "pool1_3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop1_3"
  type: "Dropout"
  bottom: "pool1_3"
  top: "pool1_3"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv2_3"
  type: "Convolution"
  bottom: "pool1_3"
  top: "conv2_3"
  param {
    name: "conv2_w"
    lr_mult: 0
  }
  param {
    name: "conv2_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.03
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_3"
  type: "ReLU"
  bottom: "conv2_3"
  top: "conv2_3"
}
layer {
  name: "cccp21_3"
  type: "Convolution"
  bottom: "conv2_3"
  top: "cccp21_3"
  param {
    name: "cccp21_w"
    lr_mult: 0
  }
  param {
    name: "cccp21_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp21_3"
  type: "ReLU"
  bottom: "cccp21_3"
  top: "cccp21_3"
}
layer {
  name: "cccp22_3"
  type: "Convolution"
  bottom: "cccp21_3"
  top: "cccp22_3"
  param {
    name: "cccp22_w"
    lr_mult: 0
  }
  param {
    name: "cccp22_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp22_3"
  type: "ReLU"
  bottom: "cccp22_3"
  top: "cccp22_3"
}
layer {
  name: "pool2_3"
  type: "Pooling"
  bottom: "cccp22_3"
  top: "pool2_3"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop2_3"
  type: "Dropout"
  bottom: "pool2_3"
  top: "pool2_3"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "pool2_3"
  top: "conv3_3"
  param {
    name: "conv3_w"
    lr_mult: 0
  }
  param {
    name: "conv3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.03
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "conv3_3"
  top: "conv3_3"
}
layer {
  name: "cccp31_3"
  type: "Convolution"
  bottom: "conv3_3"
  top: "cccp31_3"
  param {
    name: "cccp31_w"
    lr_mult: 0
  }
  param {
    name: "cccp31_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
# -> conv-out: 128 x 5 x 1 x 30 x 30
layer {
  name: "aniprobing-1_4"
  type: "Convolution"
  bottom: "data_4"
  top: "aniprobing-1_4"
  param {
    name: "aniprobing-1_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 5
    axis: 1
    kernel_size: 30
    kernel_size: 1
    kernel_size: 1
    stride: 30
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.25
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

layer {
  name: "relu-1_4"
  type: "ReLU"
  bottom: "aniprobing-1_4"
  top: "aniprobing-1_4"
}

# -> conv-out: 128 x 1 x 5 x 30 x 30
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-1_4"
  top: "aniprobing-1-rs_4"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 5
      dim: 30
      dim: 30
    }
  }
}

# -> conv-out: 128 x 5 x 1 x 30 x 30
layer {
  name: "aniprobing-2_4"
  type: "Convolution"
  bottom: "aniprobing-1-rs_4"
  top: "aniprobing-2_4"
  param {
    name: "aniprobing-2_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-2_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 5
    axis: 1
    kernel_size: 5
    kernel_size: 1
    kernel_size: 1
    stride: 5
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.45
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu-2_4"
  type: "ReLU"
  bottom: "aniprobing-2_4"
  top: "aniprobing-2_4"
}
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-2_4"
  top: "aniprobing-2-rs_4"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 5
      dim: 30
      dim: 30
    }
  }
}

# -> conv-out: 128 x 1 x 1 x 30 x 30
layer {
  name: "aniprobing-3_4"
  type: "Convolution"
  bottom: "aniprobing-2-rs_4"
  top: "aniprobing-3_4"
  param {
    name: "aniprobing-3_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 1
    axis: 1
    kernel_size: 5
    kernel_size: 1
    kernel_size: 1
    stride: 5
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.63
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

layer {
  name: "relu-3_4"
  type: "ReLU"
  bottom: "aniprobing-3_4"
  top: "aniprobing-3_4"
}

layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-3_4"
  top: "aniprobing-3-rs_4"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 30
      dim: 30
    }
  }
}
####################
layer {
  name: "conv1_4"
  type: "Convolution"
  bottom: "aniprobing-3-rs_4"
  top: "conv1_4"
  param {
    name: "conv1_w"
    lr_mult: 0
  }
  param {
    name: "conv1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.28
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_4"
  type: "ReLU"
  bottom: "conv1_4"
  top: "conv1_4"
}
layer {
  name: "cccp11_4"
  type: "Convolution"
;  bottom: "conv1_4"
  top: "cccp11_4"
  param {
    name: "cccp11_w"
    lr_mult: 0
  }
  param {
    name: "cccp11_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp11_4"
  type: "ReLU"
  bottom: "cccp11_4"
  top: "cccp11_4"
}
layer {
  name: "cccp12_4"
  type: "Convolution"
  bottom: "cccp11_4"
  top: "cccp12_4"
  param {
    name: "cccp12_w"
    lr_mult: 0
  }
  param {
    name: "cccp12_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.11
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp12_4"
  type: "ReLU"
  bottom: "cccp12_4"
  top: "cccp12_4"
}
layer {
  name: "pool1_4"
  type: "Pooling"
  bottom: "cccp12_4"
  top: "pool1_4"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop1_4"
  type: "Dropout"
  bottom: "pool1_4"
  top: "pool1_4"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv2_4"
  type: "Convolution"
  bottom: "pool1_4"
  top: "conv2_4"
  param {
    name: "conv2_w"
    lr_mult: 0
  }
  param {
    name: "conv2_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.03
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_4"
  type: "ReLU"
  bottom: "conv2_4"
  top: "conv2_4"
}
layer {
  name: "cccp21_4"
  type: "Convolution"
  bottom: "conv2_4"
  top: "cccp21_4"
  param {
    name: "cccp21_w"
    lr_mult: 0
  }
  param {
    name: "cccp21_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp21_4"
  type: "ReLU"
  bottom: "cccp21_4"
  top: "cccp21_4"
}
layer {
  name: "cccp22_4"
  type: "Convolution"
  bottom: "cccp21_4"
  top: "cccp22_4"
  param {
    name: "cccp22_w"
    lr_mult: 0
  }
  param {
    name: "cccp22_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp22_4"
  type: "ReLU"
  bottom: "cccp22_4"
  top: "cccp22_4"
}
layer {
  name: "pool2_4"
  type: "Pooling"
  bottom: "cccp22_4"
  top: "pool2_4"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop2_4"
  type: "Dropout"
  bottom: "pool2_4"
  top: "pool2_4"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv3_4"
  type: "Convolution"
  bottom: "pool2_4"
  top: "conv3_4"
  param {
    name: "conv3_w"
    lr_mult: 0
  }
  param {
    name: "conv3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.03
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_4"
  type: "ReLU"
  bottom: "conv3_4"
  top: "conv3_4"
}
layer {
  name: "cccp31_4"
  type: "Convolution"
  bottom: "conv3_4"
  top: "cccp31_4"
  param {
    name: "cccp31_w"
    lr_mult: 0
  }
  param {
    name: "cccp31_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
# -> conv-out: 128 x 5 x 1 x 30 x 30
layer {
  name: "aniprobing-1_5"
  type: "Convolution"
  bottom: "data_5"
  top: "aniprobing-1_5"
  param {
    name: "aniprobing-1_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 5
    axis: 1
    kernel_size: 30
    kernel_size: 1
    kernel_size: 1
    stride: 30
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.25
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

layer {
  name: "relu-1_5"
  type: "ReLU"
  bottom: "aniprobing-1_5"
  top: "aniprobing-1_5"
}

# -> conv-out: 128 x 1 x 5 x 30 x 30
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-1_5"
  top: "aniprobing-1-rs_5"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 5
      dim: 30
      dim: 30
    }
  }
}

# -> conv-out: 128 x 5 x 1 x 30 x 30
layer {
  name: "aniprobing-2_5"
  type: "Convolution"
  bottom: "aniprobing-1-rs_5"
  top: "aniprobing-2_5"
  param {
    name: "aniprobing-2_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-2_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 5
    axis: 1
    kernel_size: 5
    kernel_size: 1
    kernel_size: 1
    stride: 5
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.45
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu-2_5"
  type: "ReLU"
  bottom: "aniprobing-2_5"
  top: "aniprobing-2_5"
}
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-2_5"
  top: "aniprobing-2-rs_5"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 5
      dim: 30
      dim: 30
    }
  }
}

# -> conv-out: 128 x 1 x 1 x 30 x 30
layer {
  name: "aniprobing-3_5"
  type: "Convolution"
  bottom: "aniprobing-2-rs_5"
  top: "aniprobing-3_5"
  param {
    name: "aniprobing-3_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 1
    axis: 1
    kernel_size: 5
    kernel_size: 1
    kernel_size: 1
    stride: 5
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.63
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

layer {
  name: "relu-3_5"
  type: "ReLU"
  bottom: "aniprobing-3_5"
  top: "aniprobing-3_5"
}

layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-3_5"
  top: "aniprobing-3-rs_5"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 30
      dim: 30
    }
  }
}
####################
layer {
  name: "conv1_5"
  type: "Convolution"
  bottom: "aniprobing-3-rs_5"
  top: "conv1_5"
  param {
    name: "conv1_w"
    lr_mult: 0
  }
  param {
    name: "conv1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.28
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_5"
  type: "ReLU"
  bottom: "conv1_5"
  top: "conv1_5"
}
layer {
  name: "cccp11_5"
  type: "Convolution"
;  bottom: "conv1_5"
  top: "cccp11_5"
  param {
    name: "cccp11_w"
    lr_mult: 0
  }
  param {
    name: "cccp11_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp11_5"
  type: "ReLU"
  bottom: "cccp11_5"
  top: "cccp11_5"
}
layer {
  name: "cccp12_5"
  type: "Convolution"
  bottom: "cccp11_5"
  top: "cccp12_5"
  param {
    name: "cccp12_w"
    lr_mult: 0
  }
  param {
    name: "cccp12_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.11
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp12_5"
  type: "ReLU"
  bottom: "cccp12_5"
  top: "cccp12_5"
}
layer {
  name: "pool1_5"
  type: "Pooling"
  bottom: "cccp12_5"
  top: "pool1_5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop1_5"
  type: "Dropout"
  bottom: "pool1_5"
  top: "pool1_5"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv2_5"
  type: "Convolution"
  bottom: "pool1_5"
  top: "conv2_5"
  param {
    name: "conv2_w"
    lr_mult: 0
  }
  param {
    name: "conv2_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.03
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_5"
  type: "ReLU"
  bottom: "conv2_5"
  top: "conv2_5"
}
layer {
  name: "cccp21_5"
  type: "Convolution"
  bottom: "conv2_5"
  top: "cccp21_5"
  param {
    name: "cccp21_w"
    lr_mult: 0
  }
  param {
    name: "cccp21_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp21_5"
  type: "ReLU"
  bottom: "cccp21_5"
  top: "cccp21_5"
}
layer {
  name: "cccp22_5"
  type: "Convolution"
  bottom: "cccp21_5"
  top: "cccp22_5"
  param {
    name: "cccp22_w"
    lr_mult: 0
  }
  param {
    name: "cccp22_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp22_5"
  type: "ReLU"
  bottom: "cccp22_5"
  top: "cccp22_5"
}
layer {
  name: "pool2_5"
  type: "Pooling"
  bottom: "cccp22_5"
  top: "pool2_5"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop2_5"
  type: "Dropout"
  bottom: "pool2_5"
  top: "pool2_5"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv3_5"
  type: "Convolution"
  bottom: "pool2_5"
  top: "conv3_5"
  param {
    name: "conv3_w"
    lr_mult: 0
  }
  param {
    name: "conv3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.03
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_5"
  type: "ReLU"
  bottom: "conv3_5"
  top: "conv3_5"
}
layer {
  name: "cccp31_5"
  type: "Convolution"
  bottom: "conv3_5"
  top: "cccp31_5"
  param {
    name: "cccp31_w"
    lr_mult: 0
  }
  param {
    name: "cccp31_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
# -> conv-out: 128 x 5 x 1 x 30 x 30
layer {
  name: "aniprobing-1_6"
  type: "Convolution"
  bottom: "data_6"
  top: "aniprobing-1_6"
  param {
    name: "aniprobing-1_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 5
    axis: 1
    kernel_size: 30
    kernel_size: 1
    kernel_size: 1
    stride: 30
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.25
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

layer {
  name: "relu-1_6"
  type: "ReLU"
  bottom: "aniprobing-1_6"
  top: "aniprobing-1_6"
}

# -> conv-out: 128 x 1 x 5 x 30 x 30
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-1_6"
  top: "aniprobing-1-rs_6"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 5
      dim: 30
      dim: 30
    }
  }
}

# -> conv-out: 128 x 5 x 1 x 30 x 30
layer {
  name: "aniprobing-2_6"
  type: "Convolution"
  bottom: "aniprobing-1-rs_6"
  top: "aniprobing-2_6"
  param {
    name: "aniprobing-2_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-2_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 5
    axis: 1
    kernel_size: 5
    kernel_size: 1
    kernel_size: 1
    stride: 5
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.45
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu-2_6"
  type: "ReLU"
  bottom: "aniprobing-2_6"
  top: "aniprobing-2_6"
}
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-2_6"
  top: "aniprobing-2-rs_6"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 5
      dim: 30
      dim: 30
    }
  }
}

# -> conv-out: 128 x 1 x 1 x 30 x 30
layer {
  name: "aniprobing-3_6"
  type: "Convolution"
  bottom: "aniprobing-2-rs_6"
  top: "aniprobing-3_6"
  param {
    name: "aniprobing-3_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 1
    axis: 1
    kernel_size: 5
    kernel_size: 1
    kernel_size: 1
    stride: 5
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.63
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

layer {
  name: "relu-3_6"
  type: "ReLU"
  bottom: "aniprobing-3_6"
  top: "aniprobing-3_6"
}

layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-3_6"
  top: "aniprobing-3-rs_6"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 30
      dim: 30
    }
  }
}
####################
layer {
  name: "conv1_6"
  type: "Convolution"
  bottom: "aniprobing-3-rs_6"
  top: "conv1_6"
  param {
    name: "conv1_w"
    lr_mult: 0
  }
  param {
    name: "conv1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.28
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_6"
  type: "ReLU"
  bottom: "conv1_6"
  top: "conv1_6"
}
layer {
  name: "cccp11_6"
  type: "Convolution"
;  bottom: "conv1_6"
  top: "cccp11_6"
  param {
    name: "cccp11_w"
    lr_mult: 0
  }
  param {
    name: "cccp11_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp11_6"
  type: "ReLU"
  bottom: "cccp11_6"
  top: "cccp11_6"
}
layer {
  name: "cccp12_6"
  type: "Convolution"
  bottom: "cccp11_6"
  top: "cccp12_6"
  param {
    name: "cccp12_w"
    lr_mult: 0
  }
  param {
    name: "cccp12_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.11
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp12_6"
  type: "ReLU"
  bottom: "cccp12_6"
  top: "cccp12_6"
}
layer {
  name: "pool1_6"
  type: "Pooling"
  bottom: "cccp12_6"
  top: "pool1_6"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop1_6"
  type: "Dropout"
  bottom: "pool1_6"
  top: "pool1_6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv2_6"
  type: "Convolution"
  bottom: "pool1_6"
  top: "conv2_6"
  param {
    name: "conv2_w"
    lr_mult: 0
  }
  param {
    name: "conv2_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.03
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_6"
  type: "ReLU"
  bottom: "conv2_6"
  top: "conv2_6"
}
layer {
  name: "cccp21_6"
  type: "Convolution"
  bottom: "conv2_6"
  top: "cccp21_6"
  param {
    name: "cccp21_w"
    lr_mult: 0
  }
  param {
    name: "cccp21_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp21_6"
  type: "ReLU"
  bottom: "cccp21_6"
  top: "cccp21_6"
}
layer {
  name: "cccp22_6"
  type: "Convolution"
  bottom: "cccp21_6"
  top: "cccp22_6"
  param {
    name: "cccp22_w"
    lr_mult: 0
  }
  param {
    name: "cccp22_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp22_6"
  type: "ReLU"
  bottom: "cccp22_6"
  top: "cccp22_6"
}
layer {
  name: "pool2_6"
  type: "Pooling"
  bottom: "cccp22_6"
  top: "pool2_6"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop2_6"
  type: "Dropout"
  bottom: "pool2_6"
  top: "pool2_6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv3_6"
  type: "Convolution"
  bottom: "pool2_6"
  top: "conv3_6"
  param {
    name: "conv3_w"
    lr_mult: 0
  }
  param {
    name: "conv3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.03
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_6"
  type: "ReLU"
  bottom: "conv3_6"
  top: "conv3_6"
}
layer {
  name: "cccp31_6"
  type: "Convolution"
  bottom: "conv3_6"
  top: "cccp31_6"
  param {
    name: "cccp31_w"
    lr_mult: 0
  }
  param {
    name: "cccp31_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
# -> conv-out: 128 x 5 x 1 x 30 x 30
layer {
  name: "aniprobing-1_7"
  type: "Convolution"
  bottom: "data_7"
  top: "aniprobing-1_7"
  param {
    name: "aniprobing-1_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 5
    axis: 1
    kernel_size: 30
    kernel_size: 1
    kernel_size: 1
    stride: 30
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.25
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

layer {
  name: "relu-1_7"
  type: "ReLU"
  bottom: "aniprobing-1_7"
  top: "aniprobing-1_7"
}

# -> conv-out: 128 x 1 x 5 x 30 x 30
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-1_7"
  top: "aniprobing-1-rs_7"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 5
      dim: 30
      dim: 30
    }
  }
}

# -> conv-out: 128 x 5 x 1 x 30 x 30
layer {
  name: "aniprobing-2_7"
  type: "Convolution"
  bottom: "aniprobing-1-rs_7"
  top: "aniprobing-2_7"
  param {
    name: "aniprobing-2_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-2_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 5
    axis: 1
    kernel_size: 5
    kernel_size: 1
    kernel_size: 1
    stride: 5
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.45
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}
layer {
  name: "relu-2_7"
  type: "ReLU"
  bottom: "aniprobing-2_7"
  top: "aniprobing-2_7"
}
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-2_7"
  top: "aniprobing-2-rs_7"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 5
      dim: 30
      dim: 30
    }
  }
}

# -> conv-out: 128 x 1 x 1 x 30 x 30
layer {
  name: "aniprobing-3_7"
  type: "Convolution"
  bottom: "aniprobing-2-rs_7"
  top: "aniprobing-3_7"
  param {
    name: "aniprobing-3_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 1
    axis: 1
    kernel_size: 5
    kernel_size: 1
    kernel_size: 1
    stride: 5
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.63
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

layer {
  name: "relu-3_7"
  type: "ReLU"
  bottom: "aniprobing-3_7"
  top: "aniprobing-3_7"
}

layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-3_7"
  top: "aniprobing-3-rs_7"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 30
      dim: 30
    }
  }
}
####################
layer {
  name: "conv1_7"
  type: "Convolution"
  bottom: "aniprobing-3-rs_7"
  top: "conv1_7"
  param {
    name: "conv1_w"
    lr_mult: 0
  }
  param {
    name: "conv1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.28
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_7"
  type: "ReLU"
  bottom: "conv1_7"
  top: "conv1_7"
}
layer {
  name: "cccp11_7"
  type: "Convolution"
;  bottom: "conv1_7"
  top: "cccp11_7"
  param {
    name: "cccp11_w"
    lr_mult: 0
  }
  param {
    name: "cccp11_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp11_7"
  type: "ReLU"
  bottom: "cccp11_7"
  top: "cccp11_7"
}
layer {
  name: "cccp12_7"
  type: "Convolution"
  bottom: "cccp11_7"
  top: "cccp12_7"
  param {
    name: "cccp12_w"
    lr_mult: 0
  }
  param {
    name: "cccp12_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.11
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp12_7"
  type: "ReLU"
  bottom: "cccp12_7"
  top: "cccp12_7"
}
layer {
  name: "pool1_7"
  type: "Pooling"
  bottom: "cccp12_7"
  top: "pool1_7"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop1_7"
  type: "Dropout"
  bottom: "pool1_7"
  top: "pool1_7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv2_7"
  type: "Convolution"
  bottom: "pool1_7"
  top: "conv2_7"
  param {
    name: "conv2_w"
    lr_mult: 0
  }
  param {
    name: "conv2_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "gaussian"
      std: 0.03
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_7"
  type: "ReLU"
  bottom: "conv2_7"
  top: "conv2_7"
}
layer {
  name: "cccp21_7"
  type: "Convolution"
  bottom: "conv2_7"
  top: "cccp21_7"
  param {
    name: "cccp21_w"
    lr_mult: 0
  }
  param {
    name: "cccp21_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp21_7"
  type: "ReLU"
  bottom: "cccp21_7"
  top: "cccp21_7"
}
layer {
  name: "cccp22_7"
  type: "Convolution"
  bottom: "cccp21_7"
  top: "cccp22_7"
  param {
    name: "cccp22_w"
    lr_mult: 0
  }
  param {
    name: "cccp22_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu_cccp22_7"
  type: "ReLU"
  bottom: "cccp22_7"
  top: "cccp22_7"
}
layer {
  name: "pool2_7"
  type: "Pooling"
  bottom: "cccp22_7"
  top: "pool2_7"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "drop2_7"
  type: "Dropout"
  bottom: "pool2_7"
  top: "pool2_7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "conv3_7"
  type: "Convolution"
  bottom: "pool2_7"
  top: "conv3_7"
  param {
    name: "conv3_w"
    lr_mult: 0
  }
  param {
    name: "conv3_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.03
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_7"
  type: "ReLU"
  bottom: "conv3_7"
  top: "conv3_7"
}
layer {
  name: "cccp31_7"
  type: "Convolution"
  bottom: "conv3_7"
  top: "cccp31_7"
  param {
    name: "cccp31_w"
    lr_mult: 0
  }
  param {
    name: "cccp31_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    group: 1
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
# -> conv-out: 128 x 5 x 1 x 30 x 30
layer {
  name: "aniprobing-1_8"
  type: "Convolution"
  bottom: "data_8"
  top: "aniprobing-1_8"
  param {
    name: "aniprobing-1_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-1_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 5
    axis: 1
    kernel_size: 30
    kernel_size: 1
    kernel_size: 1
    stride: 30
    stride: 1
    stride: 1
    weight_filler {
        type: "gaussian"
        std: 0.25
    }
    bias_filler {
        type: "constant"
        value: 0
    }
  }
}

layer {
  name: "relu-1_8"
  type: "ReLU"
  bottom: "aniprobing-1_8"
  top: "aniprobing-1_8"
}

# -> conv-out: 128 x 1 x 5 x 30 x 30
layer {
  name: "reshape"
  type: "Reshape"
  bottom: "aniprobing-1_8"
  top: "aniprobing-1-rs_8"
  reshape_param {
    shape {
      dim: 0
      dim: 1
      dim: 5
      dim: 30
      dim: 30
    }
  }
}

# -> conv-out: 128 x 5 x 1 x 30 x 30
layer {
  name: "aniprobing-2_8"
  type: "Convolution"
  bottom: "aniprobing-1-rs_8"
  top: "aniprobing-2_8"
  param {
    name: "aniprobing-2_w"
    lr_mult: 0
  }
  param {
    name: "aniprobing-2_b"
    lr_mult: 0
  }
  convolution_param {
    num_output: 5
    axis: 1
    kernel_size: 5
    kernel_size: 1
    kernel_size: 1
    stride: 5
    stride: 1
    stride: 1
    weight_filler {
